server/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jktuglu@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "wants_mail" = $1, "zip" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["wants_mail", true], ["zip", "02467"], ["updated_at", "2021-03-18 05:24:41.934855"], ["id", 5]]
UPDATE "users" SET "wants_mail" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["wants_mail", nil], ["updated_at", "2021-03-06 02:12:09.692740"], ["id", 1]]
---
  def update
    @user = User.find_by(email: user_params[:email])
    if @user
      @user.update!(user_params)
      @user.save

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "testing@123.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jktuglu@gmail.com"], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
  def delete
    @user = User.find_by(email: user_params[:email])
    if @user
      UserMailer.with(user: @user).deletion_email.deliver_now
      reset_session
      @user.destroy