server/app/controllers/vaccines_controller.rb

  def cvs_vaccines
    @report = Report.order("created_at").last
---
SELECT "reports".* FROM "reports" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]